Catalogs/НоменклатурныеПозиции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>НоменклатурныеПозиции</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/НоменклатурныеПозиции/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	// при обмене данными ничего не проверяем
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Качество) Тогда
		Качество = Справочники.Качество.Новый;
	КонецЕсли;
	
	Если Качество = Справочники.Качество.Новый Тогда
		Качество = Справочники.Качество.ПустаяСсылка();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЗаказПокупателя) И НЕ ЗначениеЗаполнено(ХарактеристикаНоменклатуры) И НЕ ЗначениеЗаполнено(СерияНоменклатуры) И НЕ ЗначениеЗаполнено(Качество) Тогда
		ТекстСообщения = "Записываемый элемент справочника ""Номенклатурные позиции"" не содержит достаточной информации! 
		|Должно быть указано не Новое качество или хотя бы заполнен один из реквизитов 
		|""ЗаказПокупателя"", ""Характеристика"" или ""Серия""";
		ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
	ИначеЕсли ЗначениеЗаполнено(ЗаказПокупателя) Тогда
		Если Не ЗаказПокупателя.ДоговорКонтрагента.ОбособленныйУчетТоваровПоЗаказамПокупателей Тогда
			ТекстСообщения = "Указанный в записываемом элементе справочника ""Номенклатурные позиции"" Заказ покупателя
			|проведен по договору контрагента, который не подразумевает ведение обособленного учета по заказам!
			|Элемент не будет записан!";
			ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Если Не Отказ Тогда
		
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("Характеристика", ХарактеристикаНоменклатуры);
		Запрос.УстановитьПараметр("Серия", СерияНоменклатуры);
		Запрос.УстановитьПараметр("Качество", Качество);
		Запрос.УстановитьПараметр("Заказ", ЗаказПокупателя);
		Запрос.УстановитьПараметр("Владелец", Владелец);
		Запрос.УстановитьПараметр("Наименование", Наименование);
		Запрос.УстановитьПараметр("ЭтотОбъект", Ссылка);
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НоменклатурныеПозиции.Ссылка КАК Ссылка
		|ИЗ
		|   Справочник.НоменклатурныеПозиции КАК НоменклатурныеПозиции
		|ГДЕ
		| 	НоменклатурныеПозиции.Владелец                   = &Владелец И
		| 	НоменклатурныеПозиции.ХарактеристикаНоменклатуры = &Характеристика И
		|	НоменклатурныеПозиции.СерияНоменклатуры          = &Серия И
		|	НоменклатурныеПозиции.Качество                   = &Качество И
		|	НоменклатурныеПозиции.ЗаказПокупателя            = &Заказ И
		|   НоменклатурныеПозиции.Наименование               = &Наименование И
		|   НоменклатурныеПозиции.Ссылка                     <> &ЭтотОбъект";
		
		Результат = Запрос.Выполнить().Выгрузить();
		Если Результат.Количество() > 0 Тогда 
			ОбщегоНазначения.СообщитьОбОшибке("Содержание записываемого элемента справочника ""Номенклатурные позиции"" дублирует
			|содержание уже существующего элемента данного справочника. Элемент не будет записан!", Отказ);
		КонецЕсли;
		
		Если Наименование = "" Тогда
			СформироватьНаименование();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьНаименование() Экспорт
	
	ЕстьХарактеристика = ЗначениеЗаполнено(ХарактеристикаНоменклатуры);
	ЕстьСерия          = ЗначениеЗаполнено(СерияНоменклатуры);
	ЕстьКачество       = (ЗначениеЗаполнено(Качество)) И (Качество <> Справочники.Качество.Новый);
	ЕстьЗаказ          = ЗначениеЗаполнено(ЗаказПокупателя);
	
	Текст = "";
	Текст = Текст + ?(ЕстьХарактеристика, "хар.: " + ХарактеристикаНоменклатуры,"");
	Текст = Текст + ?(ЕстьСерия, ?(Текст <> "", ", ", "") + "сер.: " + СерияНоменклатуры,"");
	Текст = Текст + ?(ЕстьКачество, ?(Текст <> "", ", ", "") + "кач.: " + Качество, ?(Текст <> "", ", ", "") + "кач.: " + Справочники.Качество.Новый);
	Текст = Текст + ?(ЕстьЗаказ, ?(Текст <> "", ", ", "") + "заказ: " + ЗаказПокупателя,"");
	
	Наименование = Текст;
	
КонецПроцедуры
